Ran Plan for 2 projects:

1. dir: `terragrunt/kubernetes/authentik` workspace: `terragrunt_kubernetes_authentik`
1. dir: `terragrunt/kubernetes/authentik-config` workspace: `terragrunt_kubernetes_authentik-config`
---

### 1. dir: `terragrunt/kubernetes/authentik` workspace: `terragrunt_kubernetes_authentik`
<details><summary>Show Output</summary>

```diff
Authenticated

01:01:11.973 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/tGBn4wcNmJR18gTwfcjyki1kLVI/fBPF9Awr1xq2Klhw6lNpi62dX_A
01:01:12.015 INFO   tofu: Initializing the backend...
01:01:12.291 INFO   tofu: Initializing provider plugins...
01:01:12.292 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:12.520 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:12.628 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:12.740 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:12.895 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:12.981 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:13.091 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:13.227 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:13.385 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:13.457 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:13.476 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:13.487 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:13.519 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:13.553 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:13.573 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:01:13.609 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:13.609 INFO   tofu: OpenTofu has been successfully initialized!
01:01:14.569 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:14.569 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:14.569 STDOUT tofu:   ~ update in-place
01:01:14.569 STDOUT tofu: OpenTofu will perform the following actions:
01:01:14.569 STDOUT tofu:   # helm_release.authentik will be updated in-place
01:01:14.569 STDOUT tofu:   ~ resource "helm_release" "authentik" {
01:01:14.569 STDOUT tofu:       ~ id                         = "authentik" -> (known after apply)
01:01:14.569 STDOUT tofu:       ~ metadata                   = {
01:01:14.569 STDOUT tofu:           ~ app_version    = "2025.8.3" -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ chart          = "authentik" -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ first_deployed = 1759115175 -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ last_deployed  = 1759115175 -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ name           = "authentik" -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ namespace      = "authentik" -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ revision       = 1 -> (known after apply)
01:01:14.570 STDOUT tofu:           ~ values         = jsonencode(
01:01:14.570 STDOUT tofu:                 {
01:01:14.570 STDOUT tofu:                   - authentik  = {
01:01:14.570 STDOUT tofu:                       - bootstrap_email = "youri@youhide.com.br"
01:01:14.570 STDOUT tofu:                       - email           = {
01:01:14.570 STDOUT tofu:                           - from     = "Authentik <postmaster@mg.tkasolutions.com.br>"
01:01:14.570 STDOUT tofu:                           - host     = "smtp.mailgun.org"
01:01:14.570 STDOUT tofu:                           - port     = 587
01:01:14.570 STDOUT tofu:                           - use_tls  = true
01:01:14.570 STDOUT tofu:                           - username = "postmaster@mg.tkasolutions.com.br"
01:01:14.570 STDOUT tofu:                         }
01:01:14.570 STDOUT tofu:                     }
01:01:14.570 STDOUT tofu:                   - global     = {
01:01:14.570 STDOUT tofu:                       - env = [
01:01:14.570 STDOUT tofu:                           - {
01:01:14.570 STDOUT tofu:                               - name      = "AUTHENTIK_SECRET_KEY"
01:01:14.570 STDOUT tofu:                               - valueFrom = {
01:01:14.570 STDOUT tofu:                                   - secretKeyRef = {
01:01:14.570 STDOUT tofu:                                       - key  = "authentik-secret-key"
01:01:14.571 STDOUT tofu:                                       - name = "authentik-secrets"
01:01:14.571 STDOUT tofu:                                     }
01:01:14.571 STDOUT tofu:                                 }
01:01:14.571 STDOUT tofu:                             },
01:01:14.571 STDOUT tofu:                           - {
01:01:14.571 STDOUT tofu:                               - name      = "AUTHENTIK_EMAIL__PASSWORD"
01:01:14.571 STDOUT tofu:                               - valueFrom = {
01:01:14.571 STDOUT tofu:                                   - secretKeyRef = {
01:01:14.571 STDOUT tofu:                                       - key  = "smtp-password"
01:01:14.571 STDOUT tofu:                                       - name = "authentik-secrets"
01:01:14.571 STDOUT tofu:                                     }
01:01:14.571 STDOUT tofu:                                 }
01:01:14.571 STDOUT tofu:                             },
01:01:14.571 STDOUT tofu:                           - {
01:01:14.571 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_PASSWORD"
01:01:14.571 STDOUT tofu:                               - valueFrom = {
01:01:14.571 STDOUT tofu:                                   - secretKeyRef = {
01:01:14.571 STDOUT tofu:                                       - key  = "token"
01:01:14.571 STDOUT tofu:                                       - name = "authentik-secrets"
01:01:14.571 STDOUT tofu:                                     }
01:01:14.571 STDOUT tofu:                                 }
01:01:14.571 STDOUT tofu:                             },
01:01:14.571 STDOUT tofu:                           - {
01:01:14.571 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_TOKEN"
01:01:14.571 STDOUT tofu:                               - valueFrom = {
01:01:14.571 STDOUT tofu:                                   - secretKeyRef = {
01:01:14.571 STDOUT tofu:                                       - key  = "token"
01:01:14.571 STDOUT tofu:                                       - name = "authentik-secrets"
01:01:14.572 STDOUT tofu:                                     }
01:01:14.572 STDOUT tofu:                                 }
01:01:14.572 STDOUT tofu:                             },
01:01:14.572 STDOUT tofu:                           - {
01:01:14.572 STDOUT tofu:                               - name      = "POSTGRES_PASSWORD"
01:01:14.572 STDOUT tofu:                               - valueFrom = {
01:01:14.572 STDOUT tofu:                                   - secretKeyRef = {
01:01:14.572 STDOUT tofu:                                       - key  = "postgresql-password"
01:01:14.572 STDOUT tofu:                                       - name = "authentik-secrets"
01:01:14.572 STDOUT tofu:                                     }
01:01:14.572 STDOUT tofu:                                 }
01:01:14.572 STDOUT tofu:                             },
01:01:14.572 STDOUT tofu:                         ]
01:01:14.572 STDOUT tofu:                     }
01:01:14.572 STDOUT tofu:                   - postgresql = {
01:01:14.572 STDOUT tofu:                       - auth    = {
01:01:14.572 STDOUT tofu:                           - existingSecret = "authentik-secrets"
01:01:14.572 STDOUT tofu:                           - secretKeys     = {
01:01:14.572 STDOUT tofu:                               - userPasswordKey = "postgresql-password"
01:01:14.572 STDOUT tofu:                             }
01:01:14.572 STDOUT tofu:                         }
01:01:14.572 STDOUT tofu:                       - enabled = true
01:01:14.572 STDOUT tofu:                       - primary = {
01:01:14.572 STDOUT tofu:                           - persistence = {
01:01:14.572 STDOUT tofu:                               - accessModes  = [
01:01:14.572 STDOUT tofu:                                   - "ReadWriteOnce",
01:01:14.572 STDOUT tofu:                                 ]
01:01:14.572 STDOUT tofu:                               - size         = "4Gi"
01:01:14.572 STDOUT tofu:                               - storageClass = "longhorn"
01:01:14.572 STDOUT tofu:                               - volumeName   = "authentik-postgres"
01:01:14.572 STDOUT tofu:                             }
01:01:14.573 STDOUT tofu:                         }
01:01:14.573 STDOUT tofu:                     }
01:01:14.573 STDOUT tofu:                   - redis      = {
01:01:14.573 STDOUT tofu:                       - enabled = true
01:01:14.573 STDOUT tofu:                       - master  = {
01:01:14.573 STDOUT tofu:                           - persistence = {
01:01:14.573 STDOUT tofu:                               - accessModes  = [
01:01:14.573 STDOUT tofu:                                   - "ReadWriteOnce",
01:01:14.573 STDOUT tofu:                                 ]
01:01:14.574 STDOUT tofu:                               - size         = "2Gi"
01:01:14.574 STDOUT tofu:                               - storageClass = "local-path"
01:01:14.574 STDOUT tofu:                               - volumeName   = "authentik-redis"
01:01:14.574 STDOUT tofu:                             }
01:01:14.575 STDOUT tofu:                         }
01:01:14.575 STDOUT tofu:                     }
01:01:14.575 STDOUT tofu:                   - server     = {
01:01:14.575 STDOUT tofu:                       - ingress = {
01:01:14.575 STDOUT tofu:                           - enabled          = true
01:01:14.575 STDOUT tofu:                           - hosts            = [
01:01:14.575 STDOUT tofu:                               - "auth.tkasolutions.com.br",
01:01:14.575 STDOUT tofu:                             ]
01:01:14.575 STDOUT tofu:                           - ingressClassName = "traefik"
01:01:14.576 STDOUT tofu:                         }
01:01:14.576 STDOUT tofu:                     }
01:01:14.576 STDOUT tofu:                 }
01:01:14.576 STDOUT tofu:             ) -> (known after apply)
01:01:14.576 STDOUT tofu:           ~ version        = "2025.8.3" -> (known after apply)
01:01:14.576 STDOUT tofu:         } -> (known after apply)
01:01:14.576 STDOUT tofu:         name                       = "authentik"
01:01:14.576 STDOUT tofu:       ~ version                    = "2025.8.3" -> "2025.8.4"
01:01:14.576 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:14.576 STDOUT tofu:     }
01:01:14.577 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:14.577 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fauthentik%252Fterragrunt_kubernetes_authentik)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `terragrunt/kubernetes/authentik-config` workspace: `terragrunt_kubernetes_authentik-config`
<details><summary>Show Output</summary>

```diff
Authenticated

01:01:12.179 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/Pd89MzSQukMnunHws8xqSS9Heco/zmVgqEdizvsCb8g5tCrWwfA0e2E
01:01:12.219 INFO   tofu: Initializing the backend...
01:01:12.500 INFO   tofu: Initializing provider plugins...
01:01:12.500 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:12.730 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:12.878 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:12.979 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:13.122 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:13.278 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:13.411 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:13.524 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:13.678 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:01:13.716 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:13.732 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:13.805 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:13.826 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:13.837 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:13.870 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:13.905 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:13.905 INFO   tofu: OpenTofu has been successfully initialized!
01:01:14.837 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:14.837 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:14.837 STDOUT tofu:   ~ update in-place
01:01:14.837 STDOUT tofu: OpenTofu will perform the following actions:
01:01:14.837 STDOUT tofu:   # authentik_provider_oauth2.argocd will be updated in-place
01:01:14.837 STDOUT tofu:   ~ resource "authentik_provider_oauth2" "argocd" {
01:01:14.837 STDOUT tofu:       ~ allowed_redirect_uris      = [
01:01:14.837 STDOUT tofu:           - {
01:01:14.837 STDOUT tofu:               - "matching_mode" = "strict"
01:01:14.837 STDOUT tofu:               - "url"           = "https://argocd.youhide.com.br/auth/callback"
01:01:14.838 STDOUT tofu:             },
01:01:14.838 STDOUT tofu:         ]
01:01:14.838 STDOUT tofu:         id                         = "2"
01:01:14.838 STDOUT tofu:         name                       = "ArgoCD"
01:01:14.838 STDOUT tofu:         # (15 unchanged attributes hidden)
01:01:14.838 STDOUT tofu:     }
01:01:14.838 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:14.838 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/authentik-config -w terragrunt_kubernetes_authentik-config
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fauthentik-config%252Fterragrunt_kubernetes_authentik-config)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/authentik-config -w terragrunt_kubernetes_authentik-config
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```